{
  "extension_name": {
    "message": "Subscription Feed for YouTube",
    "description": "Extension name, the long variant (up to 45 characters)"
  },
  "extension_shortName": {
    "message": "YouTube Feed",
    "description": "Extension name, the short variant (up to 12 characters)"
  },
  "extension_description": {
    "message": "Google Chrome extension for monitoring YouTube channels for new videos.",
    "description": "Extension description"
  },

  "browserAction_title": {
    "message": "Subscription Feed for YouTube",
    "description": "Title of the browser action button"
  },

  "options_pageTitle": {
    "message": "Options - Subscription Feed for YouTube",
    "description": "Page title of the options page"
  },
  "options_title_short": {
    "message": "Options",
    "description": "In-page title of the options page (short version)"
  },
  "options_title_full": {
    "message": "Subscription Feed Options",
    "description": "In-page title of the options page"
  },

  "options_menu_accounts": {
    "message": "Accounts and subscriptions",
    "description": "Label for menu item for account & subscriptions management in the options page"
  },
  "options_menu_videos": {
    "message": "Video feed",
    "description": "Label for menu item for video feed settings and preview in the options page"
  },
  "options_menu_synchronization": {
    "message": "Synchronization",
    "description": "Label for menu item for synchronization in the options page"
  },

  "options_accounts_title": {
    "message": "YouTube accounts",
    "description": "Title of the accounts and subscriptions management section in options"
  },
  "options_accounts_add": {
    "message": "add account",
    "description": "Label for button for adding new YouTube account"
  },
  "options_accounts_notSignedIntoBrowser": {
    "message": "It appears that you are not currently signed into Chrome with your Google Account. Because of this, you will be asked to sign into Chrome when you attempt to add a YouTube account. Please sign into the Google account that is also the YouTube account you intend to add.",
    "description": "Warning shown to the user in case they are not signed into the browser"
  },
  "options_accounts_authorizationFailed": {
    "message": "You have either canceled the authorization, or the authorization failed for some reason. If you want to add a different account than the one that was shown for authorization, you need to sign out of Chrome and sign into Chrome using the account you want to add.",
    "description": "Error message shown if the OAuth2 authorization process fails when adding a new account"
  },
  "options_accounts_incognito_Title": {
    "message": "Incognito subscriptions",
    "description": "Header of the accounts managent section in options for incognito subscriptions"
  },
  "options_accounts_incognito_addPlaceholder": {
    "message": "add YouTube channel or playlist",
    "description": "placeholder for the 'add incognito subscription' input"
  },
  "options_accounts_incognito_addingSubscription": {
    "message": "Adding the new incognito subscription...",
    "description": "Message shown when a new incognito subscription is being added"
  },
  "options_accounts_incognito_apiFailure": {
    "message": "There appears to be a communication problem with the YouTube API. Because of this, the subscription cannot be added at this moment. Please repeat your attempt later.",
    "description": "Message shown if there is an error during communication with the YouTube API when adding an incognito subscription"
  },
  "options_accounts_incognito_invalidUrl_message": {
    "message": "The address you have provided is not a valid address to a YouTube channel, user or playlist. Here are some examples of valid addresses:",
    "description": "Message shown when an invalid YouTube channel, user or playlist URL is provided"
  },
  "options_accounts_incognito_invalidUrl_example1": {
    "message": "https://www.youtube.com/channel/2SdUCC55-3iny_tLUzAk2Bud (a YouTube channel)",
    "description": "The first example of a valid URL that can be used to add an incognito subscription"
  },
  "options_accounts_incognito_invalidUrl_example2": {
    "message": "https://www.youtube.com/user/someUserName3 (a YouTube user)",
    "description": "The second example of a valid URL that can be used to add an incognito subscription"
  },
  "options_accounts_incognito_invalidUrl_example3": {
    "message": "https://www.youtube.com/playlist?list=Fkskvoa44vfdsVs563dVyxd (a YouTube playlist)",
    "description": "The third example of a valid URL that can be used to add an incognito subscription"
  },
  "options_accounts_incognito_modal_close": {
    "message": "Close",
    "description": "label of the modal window closing button"
  },
  "options_accounts_incognito_modal_invalidChannelUrl_title": {
    "message": "Invalid YouTube channel address",
    "description": "Title of the modal window shown when an invalid channel URL is provided"
  },
  "options_accounts_incognito_modal_invalidChannelUrl_message": {
    "message": "While the address you provided seems to be in a valid form, it does not appear to lead to any YouTube channel - the channel may have been closed or does not exist. If you think the address is correct, please try again later, there may be an issue on the YouTube side.",
    "description": "Message of the modal window shown when an invalid channel URL is provided"
  },
  "options_accounts_incognito_modal_invalidUserUrl_title": {
    "message": "Invalid YouTube user address",
    "description": "Title of the modal window shown when an invalid user URL is provided"
  },
  "options_accounts_incognito_modal_invalidUserUrl_message": {
    "message": "While the address you provided seems to be in a valid form, it does not appear to lead to any YouTube user - the user may have closed their account or does not exist. If you think the address is correct, please try again later, there may be an issue on the YouTube side.",
    "description": "Message of the modal window shown when an invalid user URL is provided"
  },
  "options_accounts_incognito_modal_invalidPlaylistUrl_title": {
    "message": "Invalid YouTube playlist address",
    "description": "Title of the modal window shown when an invalid playlist URL is provided"
  },
  "options_accounts_incognito_modal_invalidPlaylistUrl_message": {
    "message": "While the address you provided seems to be in a valid form, it does not appear to lead to any YouTube playlist - the playlist may have been deleted or does not exist. If you think the address is correct, please try again later, there may be an issue on the YouTube side.",
    "description": "Message of the modal window shown when an invalid playlist URL is provided"
  },

  "options_videos_title": {
    "message": "Video feed",
    "description": "Title of the video feed section of the options page"
  },
  "options_videos_showWatched": {
    "message": "Show watched videos in the video feed",
    "description": "Label for the checkbox for showing watched videos in the video feed"
  },

  "options_synchronization_title": {
    "message": "Synchronization with watch history",
    "description": "Title of the synchronization section of the options page"
  },
  "options_synchronization_synchronize": {
    "message": "synchronize",
    "description": "Label on the 'synchronize' button in the synchronization section of the options page"
  },
  "options_synchronization_shortDescription": {
    "message": "Here you can synchronize the extension with your recent YouTube watch history of any of your accounts. This synchronization only marks the videos watched by the selected account as watched, it wont mark the rest as unwatched.",
    "description": "Short, initial description of the synchronization section of the options page"
  },
  "options_synchronization_longDescription": {
    "message": "The synchronization feature requires access to your private account data, which can be granted for only about an hour (unless the extension would request a 'refresh token', but there are other issues involved). That's why the synchronization is only on-demand and may require you to confirm your authorization. Please note that your watch history always contains only the videos for the last few days.",
    "description": "Long description of the synchronization feature at the bottom of the synchronization section of the options page"
  }
}